# Pandas_vs_SQL_2
- string funcation

In [24]:
import pandas as pd
import numpy as np
pd.__version__

'1.0.3'

# Raw Data

In [27]:
# order_data = pd.read_csv('order.csv', names=['id', 'ts', 'uid', 'orderid', 'amount'])
order_data.head()

   id                ts    uid      orderid  amount
0  id                ts    uid      orderid  amount
1   1   2019/08/01 9:15  10005  2.01908E+13   48.43
2   2  2019/08/01 10:00  10001  2.01908E+13   89.33
3   3  2019/08/01 10:04  10003  2.01908E+13   63.86
4   4  2019/08/01 12:17  10002  2.01908E+13    3.16

## subtstr in pandas
```
select
    *
    ,subtstr(ts, 1, 10) as dt
    ,substring(orderid, 1, 8) as dt2
from t_order
```

In [28]:
order_data['dt'] = order_data['ts'].str[:10]
# order_data['dt2'] = order_data['orderid'].str[:8]
# astype(str) ≈ cast (xxx as str)
order_data['dt2'] = order_data['orderid'].astype(str).str[:8]
order_data.head()

   id                ts    uid      orderid  amount          dt       dt2
0  id                ts    uid      orderid  amount          ts   orderid
1   1   2019/08/01 9:15  10005  2.01908E+13   48.43  2019/08/01  2.01908E
2   2  2019/08/01 10:00  10001  2.01908E+13   89.33  2019/08/01  2.01908E
3   3  2019/08/01 10:04  10003  2.01908E+13   63.86  2019/08/01  2.01908E
4   4  2019/08/01 12:17  10002  2.01908E+13    3.16  2019/08/01  2.01908E

## pattern matching sql in pandas
### like

```
select
    *
from t_order
where ts like '%08/01%'
```

In [29]:
# strなので、08/01 ≠ 08-01
order_08_01 = order_data[order_data['ts'].astype(str).str.contains('08/01')]
order_08_01

  id                ts    uid      orderid amount          dt       dt2
1  1   2019/08/01 9:15  10005  2.01908E+13  48.43  2019/08/01  2.01908E
2  2  2019/08/01 10:00  10001  2.01908E+13  89.33  2019/08/01  2.01908E
3  3  2019/08/01 10:04  10003  2.01908E+13  63.86  2019/08/01  2.01908E
4  4  2019/08/01 12:17  10002  2.01908E+13   3.16  2019/08/01  2.01908E
5  5  2019/08/01 14:05  10001  2.01908E+13  87.15  2019/08/01  2.01908E
6  6  2019/08/01 14:05  10004  2.01908E+13  88.65  2019/08/01  2.01908E

### regexp_extract
```
select
    *
    ,regexp_extract(ts,'(\\d{4}-\\d{2}-\\d{2}).*',1) as dt3
from t_order
```

In [30]:
# '(\d{4}/\d{2}/\d{2}),*' means extract '4 digit number/2 digit number/2 digit number' follow by any random Character form 'ts'
order_data['dt3'] = order_data['ts'].astype(str).str.extract('(\d{4}/\d{2}/\d{2}),*')
order_data.head()

,id,ts,uid,orderid,amount,dt,dt2,dt3
0,id,ts,uid,orderid,amount,ts,orderid,NaN
1,1,2019/08/01 9:15,10005,2.01908E+13,48.43,2019/08/01,2.01908E,2019/08/01
2,2,2019/08/01 10:00,10001,2.01908E+13,89.33,2019/08/01,2.01908E,2019/08/01
3,3,2019/08/01 10:04,10003,2.01908E+13,63.86,2019/08/01,2.01908E,2019/08/01
4,4,2019/08/01 12:17,10002,2.01908E+13,3.16,2019/08/01,2.01908E,2019/08/01

In [31]:
order_data['dt3'] = order_data['ts'].astype(str).str.extract('(\d{4}/\d{2}/\d{2}).*')
order_data.head()

,id,ts,uid,orderid,amount,dt,dt2,dt3
0,id,ts,uid,orderid,amount,ts,orderid,NaN
1,1,2019/08/01 9:15,10005,2.01908E+13,48.43,2019/08/01,2.01908E,2019/08/01
2,2,2019/08/01 10:00,10001,2.01908E+13,89.33,2019/08/01,2.01908E,2019/08/01
3,3,2019/08/01 10:04,10003,2.01908E+13,63.86,2019/08/01,2.01908E,2019/08/01
4,4,2019/08/01 12:17,10002,2.01908E+13,3.16,2019/08/01,2.01908E,2019/08/01

### regexp_replace

In [32]:
order_data['dt4'] = order_data['ts'].astype(str).str.replace('/','-')
order_data.head()

,id,ts,uid,orderid,amount,dt,dt2,dt3,dt4
0,id,ts,uid,orderid,amount,ts,orderid,NaN,ts
1,1,2019/08/01 9:15,10005,2.01908E+13,48.43,2019/08/01,2.01908E,2019/08/01,2019-08-01 9:15
2,2,2019/08/01 10:00,10001,2.01908E+13,89.33,2019/08/01,2.01908E,2019/08/01,2019-08-01 10:00
3,3,2019/08/01 10:04,10003,2.01908E+13,63.86,2019/08/01,2.01908E,2019/08/01,2019-08-01 10:04
4,4,2019/08/01 12:17,10002,2.01908E+13,3.16,2019/08/01,2.01908E,2019/08/01,2019-08-01 12:17